

#ifndef __LZO_SUPP_H_INCLUDED
#define __LZO_SUPP_H_INCLUDED 1
#if (LZO_CFG_NO_CONFIG_HEADER)

#else
#if !(LZO_CFG_AUTO_NO_HEADERS)
#if (LZO_LIBC_NAKED)

#  define HAVE_LIMITS_H 1
#  define HAVE_STDARG_H 1
#  define HAVE_STDDEF_H 1

#  define HAVE_LIMITS_H 1
#  define HAVE_SETJMP_H 1
#define HAVE_FCNTL_H 1
#define HAVE_FLOAT_H 1
#define HAVE_LIMITS_H 1
#define HAVE_MALLOC_H 1
#define HAVE_MEMORY_H 1
#define HAVE_SETJMP_H 1
#define HAVE_SYS_TIME_H 1
#define HAVE_SYS_TYPES_H 1
#if (LZO_OS_POSIX)
#  if (LZO_OS_POSIX_AIX)
#    define HAVE_ALLOCA_H 1
#  endif
#  if (LZO_LIBC_DIETLIBC || LZO_LIBC_GLIBC || LZO_LIBC_UCLIBC)
#    define HAVE_STRINGS_H 1
#    define HAVE_SYS_MMAN_H 1
#    define HAVE_SYS_RESOURCE_H 1
#    define HAVE_SYS_WAIT_H 1
#  endif
#  if (LZO_LIBC_NEWLIB)
#    undef HAVE_STRINGS_H
#  endif
#elif (LZO_OS_CYGWIN)
#  define HAVE_IO_H 1
#elif (LZO_OS_EMX)
#  define HAVE_ALLOCA_H 1
#  define HAVE_IO_H 1

#  if !defined(__MINT__)
#    undef HAVE_MALLOC_H
#  endif

#  undef HAVE_DIRENT_H
#  undef HAVE_FCNTL_H
#  undef HAVE_MALLOC_H
#define HAVE_SHARE_H 1
#if (LZO_CC_AZTECC)
#  undef HAVE_CONIO_H
#  undef HAVE_DIRECT_H
#  undef HAVE_DIRENT_H
#  undef HAVE_MALLOC_H
#  undef HAVE_SHARE_H
#  undef HAVE_UNISTD_H
#  undef HAVE_UTIME_H
#  undef HAVE_SYS_STAT_H
#  undef HAVE_SYS_TIME_H
#  undef HAVE_SYS_TYPES_H
#elif (LZO_CC_BORLANDC)
#  undef HAVE_DIRENT_H
#  undef HAVE_UNISTD_H

#elif (LZO_OS_DOS32 && LZO_CC_GNUC) && defined(__DJGPP__)

#  define HAVE_ALLOCA_H 1

LZOLIB_EXTERN(int, lzo_ascii_isupper) (int);
LZOLIB_EXTERN(int, lzo_ascii_tolower) (int);
LZOLIB_EXTERN(int, lzo_ascii_toupper) (int);
LZOLIB_EXTERN(int, lzo_ascii_utolower) (int);
LZOLIB_EXTERN(int, lzo_ascii_utoupper) (int);
#endif
#define lzo_ascii_isdigit(c)    ((LZO_ICAST(unsigned, c) - 48) < 10)



#define lzo_ascii_toupper(c)    (LZO_ICAST(int, c) - (lzo_ascii_islower(c) << 5))
#define lzo_ascii_utolower(c)   lzo_ascii_tolower(LZO_ITRUNC(unsigned char, c))
#define lzo_ascii_utoupper(c)   lzo_ascii_toupper(LZO_ITRUNC(unsigned char, c))
#ifndef lzo_hsize_t
#if (LZO_HAVE_MM_HUGE_PTR)


#  define lzo_hchar_p   char __huge *


#else
#  define lzo_hsize_t   size_t

#  define lzo_hchar_p   char *
#  define lzo_hchar_pp  char **

#endif
#endif
LZOLIB_EXTERN(lzo_hchar_p, lzo_hstrrsep) (lzo_hchar_pp, const lzo_hchar_p);
LZOLIB_EXTERN(lzo_hchar_p, lzo_ascii_hstrlwr) (lzo_hchar_p);
#if defined(lzo_int64l_t)
#endif
LZOLIB_EXTERN_NOINLINE(lzo_hvoid_p, lzo_vget_lzo_hvoid_p) (lzo_hvoid_p, int);
LZOLIB_EXTERN_NOINLINE(const lzo_hvoid_p, lzo_vget_lzo_hvoid_cp) (const lzo_hvoid_p, int);
#if !defined(LZO_FN_PATH_MAX)
#if (LZO_OS_DOS16 || LZO_OS_WIN16)
#  define LZO_FN_PATH_MAX   143
#elif (LZO_OS_DOS32 || LZO_OS_OS2 || LZO_OS_OS216 || LZO_OS_WIN32 || LZO_OS_WIN64)


#elif (LZO_OS_DOS32 && LZO_CC_GNUC) && defined(__DJGPP__)
#elif (LZO_OS_DOS32)

#endif
#endif
#if !defined(LZO_FN_NAME_MAX)
#  define LZO_FN_NAME_MAX   LZO_FN_PATH_MAX
#endif



#define LZO_FNMATCH_PERIOD          8

LZOLIB_EXTERN(int, lzo_fnmatch) (const lzo_hchar_p, const lzo_hchar_p, int);
#undef __LZOLIB_USE_OPENDIR
#if (HAVE_DIRENT_H || LZO_CC_WATCOMC)
#  define __LZOLIB_USE_OPENDIR 1
#  if (LZO_OS_DOS32 && defined(__BORLANDC__))
#  elif (LZO_OS_DOS32 && LZO_CC_GNUC) && defined(__DJGPP__)
unsigned short f_date;
unsigned long f_size;
# endif
char f_name[LZO_FN_NAME_MAX+1];
char u_dirp;
#else
void* u_dirp;
char f_name[LZO_FN_NAME_MAX+1];
#endif
} lzo_dir_t;
#ifndef lzo_dir_p

#endif
LZOLIB_EXTERN(int, lzo_opendir)  (lzo_dir_p, const char*);
LZOLIB_EXTERN(int, lzo_readdir)  (lzo_dir_p);
LZOLIB_EXTERN(int, lzo_closedir) (lzo_dir_p);
#if (LZO_CC_GNUC) && (defined(__CYGWIN__) || defined(__MINGW32__))
#  define lzo_alloca(x)     __builtin_alloca((x))
#elif (LZO_CC_GNUC) && (LZO_OS_CONSOLE_PS2)


#elif (HAVE_ALLOCA)
#  define lzo_alloca(x)     LZO_STATIC_CAST(void *, alloca((x)))
#endif
#if (LZO_OS_DOS32 && LZO_CC_GNUC) && defined(__DJGPP__)

#  define lzo_stackavail()  _stackavail()
#elif ((LZO_ARCH_I086) && LZO_CC_MSC)
#endif
LZOLIB_EXTERN(lzo_intptr_t, lzo_get_osfhandle) (int);
LZOLIB_EXTERN(const char *, lzo_getenv) (const char *);
int mode;
int read_error;
const char* name;
lzo_pclock_gettime_t gettime;
#if defined(lzo_int64l_t)
lzo_uint64l_t ticks_base;
#endif
typedef struct lzo_getopt_t lzo_getopt_t;
#ifndef lzo_getopt_p

#endif
struct lzo_getopt_longopt_t;
typedef struct lzo_getopt_longopt_t lzo_getopt_longopt_t;
#ifndef lzo_getopt_longopt_p
#define lzo_getopt_longopt_p lzo_getopt_longopt_t *
#endif
struct lzo_getopt_longopt_t {
const char* name;
int has_arg;
int* flag;
int val;
};
typedef void (*lzo_getopt_opterr_t)(lzo_getopt_p, const char*, void *);
struct lzo_getopt_t {
void *user;
const char *progname;
int bad_option;
char *optarg;
const lzo_getopt_longopt_p longopts,
int* longind);
typedef struct {
lzo_uint32l_t seed;
} lzo_rand31_t;
#ifndef lzo_rand31_p
#define lzo_rand31_p lzo_rand31_t *
#endif
LZOLIB_EXTERN(void, lzo_srand31) (lzo_rand31_p, lzo_uint32l_t);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_rand31) (lzo_rand31_p);
#if defined(lzo_int64l_t)
typedef struct {
lzo_uint64l_t seed;
} lzo_rand48_t;
} lzo_rand64_t;
#ifndef lzo_rand64_p

#endif
LZOLIB_EXTERN(void, lzo_srand64) (lzo_rand64_p, lzo_uint64l_t);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_rand64) (lzo_rand64_p);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_rand64_r32) (lzo_rand64_p);
#endif
typedef struct {
unsigned n;
lzo_uint32l_t s[624];
} lzo_randmt_t;
#ifndef lzo_randmt_p
#define lzo_randmt_p lzo_randmt_t *
#endif
LZOLIB_EXTERN(void, lzo_srandmt) (lzo_randmt_p, lzo_uint32l_t);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_randmt) (lzo_randmt_p);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_randmt_r32) (lzo_randmt_p);
#if defined(lzo_int64l_t)
typedef struct {
unsigned n;
lzo_uint64l_t s[312];
} lzo_randmt64_t;
#ifndef lzo_randmt64_p
#define lzo_randmt64_p lzo_randmt64_t *
#endif
LZOLIB_EXTERN(void, lzo_srandmt64) (lzo_randmt64_p, lzo_uint64l_t);
LZOLIB_EXTERN(lzo_uint64l_t, lzo_randmt64_r64) (lzo_randmt64_p);
#endif
#define __LZO_CXX_H_INCLUDED 1
#if defined(__cplusplus)
#if defined(LZO_CXX_NOTHROW)
#elif (LZO_CC_TURBOC)

#else
#  define __LZO_CXX_HAVE_ARRAY_NEW 1
#endif
#if (__LZO_CXX_HAVE_ARRAY_NEW)

#endif
#if (__LZO_CXX_HAVE_PLACEMENT_NEW)
#  if (LZO_CC_GNUC >= 0x030000ul)
#    define __LZO_CXX_HAVE_PLACEMENT_DELETE 1
#  elif (LZO_CC_INTELC)
#    define __LZO_CXX_HAVE_PLACEMENT_DELETE 1
#  elif (LZO_CC_MSC && (_MSC_VER >= 1200))
#    define __LZO_CXX_HAVE_PLACEMENT_DELETE 1


#  elif (LZO_CC_PGI)

#  endif
#endif
#if defined(LZO_CXX_DISABLE_NEW_DELETE)
#elif defined(new) || defined(delete)
#  define LZO_CXX_DISABLE_NEW_DELETE private:


#elif  (LZO_CC_HIGHC)
#  define LZO_CXX_DISABLE_NEW_DELETE private:


protected: static void operator delete(void*) __LZO_CXX_DO_DELETE \
protected: static void* operator new(size_t) __LZO_CXX_DO_NEW \
private:
#else

protected: static void operator delete(void*) __LZO_CXX_DO_DELETE \
static void operator delete[](void*) __LZO_CXX_DO_DELETE \
#else
#  define LZO_CXX_TRIGGER_FUNCTION_IMPL(klass) \
const void* klass::lzo_cxx_trigger_function() const { return LZO_STATIC_CAST(const void *, 0); }
#endif
#endif
#endif
#endif
#if defined(LZO_WANT_ACC_CHK_CH)
#  undef LZO_WANT_ACC_CHK_CH
#if !defined(LZOCHK_ASSERT)
#  define LZOCHK_ASSERT(expr)   LZO_COMPILE_TIME_ASSERT_HEADER(expr)
#endif
#if !defined(LZOCHK_ASSERT_SIGN_T)
#  define LZOCHK_ASSERT_SIGN_T(type,relop) \
LZOCHK_ASSERT( LZO_STATIC_CAST(type, -1)  relop  LZO_STATIC_CAST(type, 0)) \
LZOCHK_ASSERT( LZO_STATIC_CAST(type, ~LZO_STATIC_CAST(type, 0)) relop  LZO_STATIC_CAST(type, 0)) \
LZOCHK_ASSERT( LZO_STATIC_CAST(type, ~LZO_STATIC_CAST(type, 0)) ==     LZO_STATIC_CAST(type, -1))
#endif
#if !defined(LZOCHK_ASSERT_IS_SIGNED_T)
#  define LZOCHK_ASSERT_IS_SIGNED_T(type)       LZOCHK_ASSERT_SIGN_T(type,<)
#endif
#if !defined(LZOCHK_ASSERT_IS_UNSIGNED_T)
#  if (LZO_BROKEN_INTEGRAL_PROMOTION)
#    define LZOCHK_ASSERT_IS_UNSIGNED_T(type) \
LZOCHK_ASSERT( LZO_STATIC_CAST(type, -1) > LZO_STATIC_CAST(type, 0) )
#  else
#    define LZOCHK_ASSERT_IS_UNSIGNED_T(type)   LZOCHK_ASSERT_SIGN_T(type,>)
#  endif
#endif
#if defined(LZOCHK_CFG_PEDANTIC)
#if (LZO_CC_BORLANDC && (__BORLANDC__ >= 0x0550) && (__BORLANDC__ < 0x0560))

#elif (LZO_CC_BORLANDC && (__BORLANDC__ >= 0x0530) && (__BORLANDC__ < 0x0550))
#  pragma option push -w-osh
#endif
#endif
#if (LZO_0xffffffffL - LZO_UINT32_C(4294967294) != 1)
#  error "preprocessor error""preprocessor error"
#endif
#if +0

#endif
#if -0
#  error "preprocessor error"
#endif
#if +0 != 0
#  error "preprocessor error"
#endif
#if -0 != 0
#  error "preprocessor error"
#endif
#define LZOCHK_VAL  1
#define LZOCHK_TMP1 LZOCHK_VAL
#undef LZOCHK_VAL
#define LZOCHK_VAL  2
#define LZOCHK_TMP2 LZOCHK_VAL
#if (LZOCHK_TMP1 != 2)
#  error "preprocessor error 3a"
#endif
#undef LZOCHK_TMP1
#undef LZOCHK_TMP2
#if 0 || defined(LZOCHK_CFG_PEDANTIC)
#  if (LZO_ARCH_MIPS) && defined(_MIPS_SZINT)
LZOCHK_ASSERT((_MIPS_SZINT) == 8 * sizeof(int))
#  endif
#  if (LZO_ARCH_MIPS) && defined(_MIPS_SZLONG)
LZOCHK_ASSERT((_MIPS_SZLONG) == 8 * sizeof(long))
#  endif
#  if (LZO_ARCH_MIPS) && defined(_MIPS_SZPTR)
LZOCHK_ASSERT((_MIPS_SZPTR) == 8 * sizeof(void *))
#  endif
#endif
LZOCHK_ASSERT(1 == 1)
LZOCHK_ASSERT(__LZO_MASK_GEN(1u,1) == 1u)
LZOCHK_ASSERT(__LZO_MASK_GEN(1u,2) == 3u)
LZOCHK_ASSERT(__LZO_MASK_GEN(1u,3) == 7u)
LZOCHK_ASSERT(__LZO_MASK_GEN(1u,8) == 255u)
#if (LZO_SIZEOF_INT >= 2)
LZOCHK_ASSERT(__LZO_MASK_GEN(1,15) == 32767)
LZOCHK_ASSERT(__LZO_MASK_GEN(1u,16) == 0xffffU)
LZOCHK_ASSERT(__LZO_MASK_GEN(0u,16) == 0u)
#endif
LZOCHK_ASSERT(__LZO_MASK_GEN(1ul,16) == 0xffffUL)
LZOCHK_ASSERT(__LZO_MASK_GEN(0ul,16) == 0ul)
#if (LZO_SIZEOF_INT >= 4)
LZOCHK_ASSERT(__LZO_MASK_GEN(0ul,64) == 0ul)
#endif
#if 1
LZOCHK_ASSERT(__LZO_MASK_GEN(2,1) == 2)
LZOCHK_ASSERT(__LZO_MASK_GEN(7,3) == 7+14+28)
#endif
#if !(LZO_BROKEN_SIGNED_RIGHT_SHIFT)
LZOCHK_ASSERT(((-1) >> 7) == -1)
#endif
LZOCHK_ASSERT(((1)  >> 7) == 0)
#if (LZO_CC_INTELC && (__INTEL_COMPILER >= 900))
#  pragma warning(push)
#  pragma warning(disable: 1025)
#endif
LZOCHK_ASSERT((~0l  & ~0)  == ~0l)
LZOCHK_ASSERT((~0l  & ~0u) == ~0u)
LZOCHK_ASSERT((~0ul & ~0)  == ~0ul)
LZOCHK_ASSERT((~0ul & ~0u) == ~0u)
#if defined(__MSDOS__) && defined(__TURBOC__) && (__TURBOC__ < 0x0150)
#elif (LZO_SIZEOF_INT == 2)
LZOCHK_ASSERT((~0l  & ~0u) == 0xffffU)
LZOCHK_ASSERT((~0ul & ~0u) == 0xffffU)
#elif (LZO_SIZEOF_INT == 4)
#endif
#if defined(__cplusplus)
LZOCHK_ASSERT(sizeof('\0') == sizeof(char))
#else
#  if (LZO_CC_DMC)
#  else
LZOCHK_ASSERT(sizeof('\0') == sizeof(int))
#  endif
#endif
#if defined(__lzo_alignof)
LZOCHK_ASSERT(__lzo_alignof(char) == 1)
LZOCHK_ASSERT(__lzo_alignof(signed char) == 1)
LZOCHK_ASSERT(__lzo_alignof(unsigned char) == 1)
LZOCHK_ASSERT(sizeof(short) == sizeof(LZO_STATIC_CAST(short, 0)))
#endif
LZOCHK_ASSERT(sizeof(int) == sizeof(0))
LZOCHK_ASSERT(sizeof(int) == sizeof(LZO_STATIC_CAST(int, 0)))
#if (LZO_SIZEOF_INT > 0)
LZOCHK_ASSERT(sizeof(int) == LZO_SIZEOF_INT)
#endif
LZOCHK_ASSERT(sizeof(0) == sizeof(int))
LZOCHK_ASSERT_IS_SIGNED_T(long)
LZOCHK_ASSERT_IS_UNSIGNED_T(unsigned long)
LZOCHK_ASSERT(sizeof(long) == sizeof(unsigned long))
#if !(LZO_ABI_I8LP16)
LZOCHK_ASSERT(sizeof(long) >= 4)
#endif
LZOCHK_ASSERT(sizeof(long) >= sizeof(int))
LZOCHK_ASSERT(sizeof(long) == sizeof(0L))
LZOCHK_ASSERT(sizeof(long) == sizeof(LZO_STATIC_CAST(long, 0)))
#if (LZO_SIZEOF_LONG > 0)
LZOCHK_ASSERT(sizeof(long) == LZO_SIZEOF_LONG)
#endif
LZOCHK_ASSERT(sizeof(0L) == sizeof(long))
LZOCHK_ASSERT_IS_UNSIGNED_T(size_t)
LZOCHK_ASSERT(sizeof(size_t) >= sizeof(int))
LZOCHK_ASSERT(sizeof(size_t) == sizeof(sizeof(0)))
#if (LZO_SIZEOF_SIZE_T > 0)
LZOCHK_ASSERT(sizeof(size_t) == LZO_SIZEOF_SIZE_T)
#endif
LZOCHK_ASSERT_IS_SIGNED_T(ptrdiff_t)
LZOCHK_ASSERT(sizeof(ptrdiff_t) >= sizeof(int))
LZOCHK_ASSERT(sizeof(ptrdiff_t) >= sizeof(size_t))
#if !(LZO_BROKEN_SIZEOF)
LZOCHK_ASSERT(sizeof(void*) == LZO_SIZEOF_VOID_P)
LZOCHK_ASSERT(sizeof(char*) == LZO_SIZEOF_VOID_P)
#endif
#if (LZO_HAVE_MM_HUGE_PTR)
LZOCHK_ASSERT(4 == sizeof(void __huge*))
LZOCHK_ASSERT(4 == sizeof(char __huge*))
#endif
#if (LZO_ABI_I8LP16)
LZOCHK_ASSERT((((1u  <<  7) + 1) >>  7) == 1)
LZOCHK_ASSERT((((1ul << 15) + 1) >> 15) == 1)
#else
LZOCHK_ASSERT((((1u  << 15) + 1) >> 15) == 1)
LZOCHK_ASSERT((((1ul << 31) + 1) >> 31) == 1)
#endif
#if defined(LZOCHK_CFG_PEDANTIC)
#if defined(__MSDOS__) && defined(__TURBOC__) && (__TURBOC__ < 0x0150)
#else
LZOCHK_ASSERT((1   << (8*LZO_SIZEOF_INT-1)) < 0)
#endif
#endif
LZOCHK_ASSERT((1u  << (8*LZO_SIZEOF_INT-1)) > 0)
#if defined(LZOCHK_CFG_PEDANTIC)
LZOCHK_ASSERT((1l  << (8*LZO_SIZEOF_LONG-1)) < 0)
#endif
LZOCHK_ASSERT((1ul << (8*LZO_SIZEOF_LONG-1)) > 0)
#if defined(lzo_int16e_t)
LZOCHK_ASSERT(sizeof(lzo_int16e_t) == 2)
LZOCHK_ASSERT(sizeof(lzo_int16e_t) == LZO_SIZEOF_LZO_INT16E_T)
LZOCHK_ASSERT(sizeof(lzo_uint16e_t) == 2)
LZOCHK_ASSERT(sizeof(lzo_int16e_t) == sizeof(lzo_uint16e_t))
LZOCHK_ASSERT_IS_SIGNED_T(lzo_int16e_t)
LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint16e_t)
#if defined(__MSDOS__) && defined(__TURBOC__) && (__TURBOC__ < 0x0150)
#else
LZOCHK_ASSERT((LZO_STATIC_CAST(lzo_uint16e_t, (~LZO_STATIC_CAST(lzo_uint16e_t,0ul))) >> 15) == 1)
#endif
LZOCHK_ASSERT( LZO_STATIC_CAST(lzo_int16e_t, (1 + ~LZO_STATIC_CAST(lzo_int16e_t, 0))) == 0)
#if defined(LZOCHK_CFG_PEDANTIC)
LZOCHK_ASSERT( LZO_STATIC_CAST(lzo_uint16e_t, (1 + ~LZO_STATIC_CAST(lzo_uint16e_t, 0))) == 0)
#endif
#endif
#if defined(lzo_int32e_t)
LZOCHK_ASSERT(sizeof(lzo_int32e_t) == 4)
LZOCHK_ASSERT(sizeof(lzo_int32e_t) == LZO_SIZEOF_LZO_INT32E_T)
LZOCHK_ASSERT(sizeof(lzo_uint32e_t) == 4)
#endif
#if defined(lzo_int32e_t)
LZOCHK_ASSERT(sizeof(lzo_int32l_t) >= sizeof(lzo_int32e_t))
#endif
LZOCHK_ASSERT(sizeof(lzo_int32l_t) >= 4)
LZOCHK_ASSERT(sizeof(lzo_int32l_t) == LZO_SIZEOF_LZO_INT32L_T)
LZOCHK_ASSERT(sizeof(lzo_uint32l_t) >= 4)
LZOCHK_ASSERT(sizeof(lzo_int32l_t) == sizeof(lzo_uint32l_t))
LZOCHK_ASSERT_IS_SIGNED_T(lzo_int32l_t)
LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_int32l_t, 1) << 30) + 1) >> 30) == 1)
LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint32l_t)
LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_uint32l_t, 1) << 31) + 1) >> 31) == 1)
LZOCHK_ASSERT(sizeof(lzo_int32f_t) >= sizeof(int))
#if defined(lzo_int32e_t)
LZOCHK_ASSERT(sizeof(lzo_int32f_t) >= sizeof(lzo_int32e_t))
#endif
LZOCHK_ASSERT(sizeof(lzo_int32f_t) >= sizeof(lzo_int32l_t))
LZOCHK_ASSERT(sizeof(lzo_int32f_t) >= 4)
LZOCHK_ASSERT(sizeof(lzo_int32f_t) >= sizeof(lzo_int32l_t))
LZOCHK_ASSERT(sizeof(lzo_int32f_t) == LZO_SIZEOF_LZO_INT32F_T)
LZOCHK_ASSERT(sizeof(lzo_uint32f_t) >= 4)
LZOCHK_ASSERT(sizeof(lzo_uint32f_t) >= sizeof(lzo_uint32l_t))
LZOCHK_ASSERT(sizeof(lzo_int32f_t) == sizeof(lzo_uint32f_t))
LZOCHK_ASSERT_IS_SIGNED_T(lzo_int32f_t)
LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_int32f_t, 1) << 30) + 1) >> 30) == 1)
LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint32f_t)
LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_uint32f_t, 1) << 31) + 1) >> 31) == 1)
#if defined(lzo_int64e_t)
LZOCHK_ASSERT(sizeof(lzo_int64e_t) == 8)
LZOCHK_ASSERT(sizeof(lzo_int64e_t) == LZO_SIZEOF_LZO_INT64E_T)
LZOCHK_ASSERT(sizeof(lzo_uint64e_t) == 8)
LZOCHK_ASSERT(sizeof(lzo_int64e_t) == sizeof(lzo_uint64e_t))
LZOCHK_ASSERT_IS_SIGNED_T(lzo_int64e_t)
#if (LZO_CC_BORLANDC && (__BORLANDC__ < 0x0530))
#else
LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint64e_t)
#endif
#endif
#if defined(lzo_int64l_t)
#if defined(lzo_int64e_t)
LZOCHK_ASSERT(sizeof(lzo_int64l_t) >= sizeof(lzo_int64e_t))
LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint64l_t)
LZOCHK_ASSERT(LZO_UINT64_C(18446744073709551615)     > 0)
#endif
LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_uint64l_t, 1) << 63) + 1) >> 63) == 1)
LZOCHK_ASSERT(((( LZO_UINT64_C(1) << 63) + 1) >> 63) == 1)
#if (LZO_CC_GNUC && (LZO_CC_GNUC < 0x020600ul))
LZOCHK_ASSERT(LZO_INT64_C(9223372036854775807)       > LZO_INT64_C(0))
#else
LZOCHK_ASSERT(LZO_INT64_C(9223372036854775807)       > 0)
#endif
#if (LZO_CC_BORLANDC && (__BORLANDC__ < 0x0530))
#else
LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint64f_t)
#endif
#endif
#if !defined(__LZO_INTPTR_T_IS_POINTER)
LZOCHK_ASSERT_IS_SIGNED_T(lzo_intptr_t)
LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uintptr_t)
#endif
LZOCHK_ASSERT(sizeof(lzo_intptr_t) >= sizeof(void *))
LZOCHK_ASSERT(sizeof(lzo_uint8_t) == 1)
LZOCHK_ASSERT(sizeof(lzo_int8_t) == sizeof(lzo_uint8_t))
LZOCHK_ASSERT_IS_SIGNED_T(lzo_int8_t)
LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint8_t)
#if defined(LZO_INT16_C)
LZOCHK_ASSERT(sizeof(LZO_INT16_C(0)) >= 2)
LZOCHK_ASSERT(sizeof(LZO_UINT16_C(0)) >= 2)
LZOCHK_ASSERT((LZO_UINT16_C(0xffff) >> 15) == 1)
#endif
#if defined(LZO_INT32_C)
LZOCHK_ASSERT(sizeof(LZO_INT32_C(0)) >= 4)
LZOCHK_ASSERT((LZO_UINT64_C(0xffffffffffffffff) & ~0)  == LZO_UINT64_C(0xffffffffffffffff))
LZOCHK_ASSERT((LZO_UINT64_C(0xffffffffffffffff) & ~0l) == LZO_UINT64_C(0xffffffffffffffff))
#if (LZO_SIZEOF_INT == 4)
# if (LZO_CC_GNUC && (LZO_CC_GNUC < 0x020000ul))
# else
LZOCHK_ASSERT((LZO_UINT64_C(0xffffffffffffffff) & (~0u+0u)) == 0xffffffffu)
# endif
#endif
#if (LZO_SIZEOF_LONG == 4)
# if (LZO_CC_GNUC && (LZO_CC_GNUC < 0x020000ul))
# else
LZOCHK_ASSERT((LZO_UINT64_C(0xffffffffffffffff) & (~0ul+0ul)) == 0xfffffffful)
# endif
#endif
#endif
#if (LZO_MM_TINY || LZO_MM_SMALL || LZO_MM_MEDIUM)
LZOCHK_ASSERT(sizeof(void*) == 2)
LZOCHK_ASSERT(sizeof(ptrdiff_t) == 2)
LZOCHK_ASSERT(sizeof(long) == 4)
LZOCHK_ASSERT(sizeof(void*) == 8)
LZOCHK_ASSERT(sizeof(ptrdiff_t) == sizeof(void*))
LZOCHK_ASSERT(sizeof(size_t) == sizeof(void*))
LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(void *))
#endif
#if (LZO_ABI_LP32)
LZOCHK_ASSERT(sizeof(int) == 2)
LZOCHK_ASSERT(sizeof(long) == 4)
LZOCHK_ASSERT(sizeof(void*) == 4)
LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(void *))
#endif
#if (LZO_ABI_LP64)
LZOCHK_ASSERT(sizeof(int) == 4)
LZOCHK_ASSERT(sizeof(long) == 8)
LZOCHK_ASSERT(sizeof(void*) == 8)
LZOCHK_ASSERT(sizeof(ptrdiff_t) == sizeof(void*))
LZOCHK_ASSERT(sizeof(size_t) == sizeof(void*))
LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(void *))
#endif
#if (LZO_ABI_IP32W64)
#endif
#if (LZO_CC_NDPC)
#elif (LZO_SIZEOF_INT > 1)
LZOCHK_ASSERT( LZO_STATIC_CAST(int, LZO_STATIC_CAST(unsigned char, LZO_STATIC_CAST(signed char, -1))) == 255)
#endif
#if defined(LZOCHK_CFG_PEDANTIC)
#if (LZO_CC_KEILC)
#elif (LZO_CC_NDPC)
#elif !(LZO_BROKEN_INTEGRAL_PROMOTION) && (LZO_SIZEOF_INT > 1)
LZOCHK_ASSERT( ((LZO_STATIC_CAST(unsigned char, 128)) << LZO_STATIC_CAST(int, (8*sizeof(int)-8))) < 0)
#endif
#endif
#if defined(LZOCHK_CFG_PEDANTIC)
#if (LZO_CC_BORLANDC && (__BORLANDC__ >= 0x0530) && (__BORLANDC__ < 0x0560))
#  pragma option pop
#endif
#endif
#endif
#if defined(LZO_WANT_ACCLIB_VGET)
#  undef LZO_WANT_ACCLIB_VGET

#if !defined(LZOLIB_PUBLIC)

#endif
#if !defined(LZOLIB_PUBLIC_NOINLINE)
#  if !defined(__lzo_noinline)
